Revit 2026 API

# WireDistributionDirection Enumeration

---

Defines the direction of the distribution of wires in a Fabric Sheet.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum WireDistributionDirection
```
```vb
Public Enumeration WireDistributionDirection
```
```cpp
public enum class WireDistributionDirection
```
```fsharp
type WireDistributionDirection
```

| Member name | Value | Description |
| --- | --- | --- |
| Major | 0 | Wires are distributed in the Major direction. |
| Minor | 1 | Wires are distributed in the Minor direction. |

#### Reference

Autodesk.Revit.DB.Structure Namespace